Revit 2027 API
FamilyManager.ReplaceParameter Method
Overload List
Name | Description
ReplaceParameter(FamilyParameter, ExternalDefinition, ForgeTypeId, Boolean) | Replace a family parameter with a shared parameter.
ReplaceParameter(FamilyParameter, String, ForgeTypeId, Boolean) | Replace a shared family parameter with a new non-shared family parameter.
Top
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace